&НаКлиенте
Функция ПоместитьФайлВоВременноеХранилище()
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(Команда)
	
	АдресФайлаВоВременномХранилище = ПоместитьФайлВоВременноеХранилище();
	ЗагрузитьДанныеИзФайлаНаСервере(АдресФайлаВоВременномХранилище);	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеДокументы(Команда)
	УдалитьВсеДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработкуДокументов(Команда)
	ЗапуститьОбработкуДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзФайлаНаСервере(АдресФайлаВоВременномХранилище)
	
	РегламентныеИФоновыеЗадания.ВыполнитьЗагрузкуУслугСортировки(АдресФайлаВоВременномХранилище);	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеДокументыНаСервере()
	
	РегламентныеИФоновыеЗадания.ВыполнитьУдалениеУслугСортировкиВФоновомЗадание();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбработкуДокументовНаСервере()
	
	РегламентныеИФоновыеЗадания.ВыполнитьРасчетЗаМесяц(ДатаМесяц);
КонецПроцедуры


