#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет является ли указанная дата выходным днем
//
// Параметры:
//  ДатаДень  - Дата - Дата для определения выходной, ли
//
// Возвращаемое значение:
//   Булево   - Если выходной - Истина, иначе - Ложь
//
Функция ЭтоВыходной(ДатаДень)Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДатаДень.Установить(ДатаДень);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Возврат НаборЗаписей[0].Выходной;
	КонецЕсли;               
	Возврат Ложь;
КонецФункции // ЭтоВыходной()

#КонецОбласти

#КонецЕсли